class Resources:
    START = "Добрый вечер, я диспетчер. Первым делом пройдите регистрацию! (В регистрации спрятана пасхалка)"
    SIGNED_UP = "Вы уже зарегистрированы! Удалить свой профиль (и пройти регистрацию заново) - /kill"
    NOT_SIGNED_UP = "Вас нет в нашей Базе Данных. Пожалуйста, пройдите регистрацию заново с помощью команды /start"
    KILLED_SUCCESS = (
        "Вы стёрты из нашей Базы Данных. Введите /start чтобы заново начать регистрацию"
    )
    NAME = "Введите своё киберимя"
    EMAIL = "Введите своё кибермыло"
    EMAIL_INVALID = "Твоё кибермыло киберинвалидно"
    SURNAME = "Введите свою киберфамилию"
    NICKNAME = "Введите своё киберник"
    CITY = "Введите свой кибергород"
    AGE = "Введите свой кибервозраст (цифрами)"
    AGE_INVALID = "Твой возраст киберинвалиден"
    GRADE = "Введите свой киберкласс"
    SCHOOL = "Введите свою кибершколу (название полностью)"
    REGISTRATION_COMPLETE = "Спасибо за регистрацию!"
