import re


class Resources:
    COMMANDS_LIST = ['/register', '/admin', '/help']
    ADMIN_PASS = (open("admin_pass.txt", "r")).readlines()[0][0:-1]
    ADMIN_SUCCESS = 'О привет киберпидорский админ'
    ADMIN_FAILURE = 'Увы, пороль неверный (лох)'
    START_MSG = "Добрый вечер, я диспетчер. Зарегистрируйтесь!"
    NAME = "Введите своё киберимя"
    SURNAME = "Введите свою киберфамилию"
    MAIL = "Введите своё кибермыло"
    MAIL_INVALID = "Твоё кибермыло киберинвалидно"
    NEW_MAIL = "Введи нонрмальное кибермыло киберинвалид"
    MAIL_REGEX = re.compile(
        "(?:[a-z0-9!#$%&'*+/=?^_`{|}~-]+(?:\.[a-z0-9!#$%&'*+/=?^_`{|}~-]+)*|\"(?:[\x01-\x08\x0b\x0c\x0e-\x1f\x21\x23-\x5b\x5d-\x7f]|\\[\x01-\x09\x0b\x0c\x0e-\x7f])*\")@(?:(?:[a-z0-9](?:[a-z0-9-]*[a-z0-9])?\.)+[a-z0-9](?:[a-z0-9-]*[a-z0-9])?|\[(?:(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)\.){3}(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?|[a-z0-9-]*[a-z0-9]:(?:[\x01-\x08\x0b\x0c\x0e-\x1f\x21-\x5a\x53-\x7f]|\\[\x01-\x09\x0b\x0c\x0e-\x7f])+)\])"
    )
    NICKNAME = "Введите своё киберник"
    CITY = "Введите свой кибергород"
    AGE = "Введите свой кибервозраст"
    GRADE = "Введите свой киберкласс"
    SCHOOL = "Введите свою кибершколу"
    REGISTRATION_COMPLETE = "Спасибо за регистрацию!"
    ALR_REGISTERED = "Вы уже зарегистрированы, для просмотра всех компанд напишите /help"
